Revit 2024 API
IFCLegacyStairOrRamp.GetRunGeometries Method
 Gets the geometries of runs.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<IList<GeometryObject>> GetRunGeometries()
Visual Basic
Public Function GetRunGeometries As IList(Of IList(Of GeometryObject))
Visual C++
public:
IList<IList<GeometryObject^>^>^ GetRunGeometries()
Return Value
 The geometries of runs.
See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace